# Working with Date Columns in DataFrame

In [73]:
df = sns.load_dataset('taxis')
df.head(2)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan

In [74]:
df.shape

(6433, 14)

##  Handling with Pandas DateTimeIndex

###### Checking datatype of DataFrame

In [75]:
# checking data type of dataframe columns - pickup and dropoff columns are object/string
df.dtypes

pickup              object
dropoff             object
passengers           int64
distance           float64
fare               float64
tip                float64
tolls              float64
total              float64
color               object
payment             object
pickup_zone         object
dropoff_zone        object
pickup_borough      object
dropoff_borough     object
dtype: object

###### Converting date column datatype

In [76]:
df['pickup'] = pd.to_datetime(df['pickup'])
df['dropoff'] = pd.to_datetime(df['dropoff'])

In [77]:
df.dtypes

pickup             datetime64[ns]
dropoff            datetime64[ns]
passengers                  int64
distance                  float64
fare                      float64
tip                       float64
tolls                     float64
total                     float64
color                      object
payment                    object
pickup_zone                object
dropoff_zone               object
pickup_borough             object
dropoff_borough            object
dtype: object

###### Extract Month,Week,Day number from Date Column

In [153]:
df['Pickup_Month']=pd.DatetimeIndex(df['pickup']).month
df['Pickup_Day']=pd.DatetimeIndex(df['pickup']).day
df['Pickup_Week']=pd.DatetimeIndex(df['pickup']).week
df['Pickup_WeekDay']=pd.DatetimeIndex(df['pickup']).weekday
df.iloc[: , 12:].head(4)

C:\Users\skum108\AppData\Local\Temp\ipykernel_21388\2542945681.py:3: FutureWarning: weekofyear and week have been deprecated, please use DatetimeIndex.isocalendar().week instead, which returns a Series. To exactly reproduce the behavior of week and weekofyear and return an Index, you may call pd.Int64Index(idx.isocalendar().week)
  df['Pickup_Week']=pd.DatetimeIndex(df['pickup']).week

,pickup_borough,dropoff_borough,Pickup_Month,Pickup_Day,Pickup_Week,Pickup_WeekDay,month_name
0,Manhattan,Manhattan,3,23,12,5,March
1,Manhattan,Manhattan,3,4,10,0,March
2,Manhattan,Manhattan,3,27,13,2,March
3,Manhattan,Manhattan,3,10,10,6,March

## Import DateTime Library

#### Converting Week Num and Month Num in Names

In [79]:
import datetime as dt

In [80]:
#Checking all formats with datatime
print(dir(dt))

['MAXYEAR', 'MINYEAR', '__all__', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'sys', 'time', 'timedelta', 'timezone', 'tzinfo']

In [81]:
df.head(2)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,Pickup_Month,Pickup_Day,Pickup_Week,Pickup_WeekDay
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan,3,23,12,5
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan,3,4,10,0

# Strftime()function

Pythom time method strftime() converts a tuple or struct_time representing a time as returned by gmtime() or localtime() to a string as specified by the format argument.

https://www.tutorialspoint.com/python/time_strftime.htm#:~:text=Python%20time%20strftime%20%28%29%20Method%201%20Description%20Pythom,4%20Directive%20%25a%20-%20abbreviated%20weekday%20name%20

In [82]:
import datetime as dt
print(dir(dt))

['MAXYEAR', 'MINYEAR', '__all__', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'sys', 'time', 'timedelta', 'timezone', 'tzinfo']

Directive
%a - abbreviated weekday name
%A - full weekday name
%b - abbreviated month name
%B - full month name
%c - preferred date and time representation
%C - century number (the year divided by 100, range 00 to 99)
%d - day of the month (01 to 31)
%D - same as %m/%d/%y
%e - day of the month (1 to 31)
%g - like %G, but without the century

In [83]:
df.columns
date_col_list = ['pickup', 'dropoff','Pickup_Month', 'Pickup_Week','Pickup_Day', 'Pickup_WeekDay']

In [84]:
df1=df.loc[:, date_col_list]

In [85]:
df1['1'] = df.pickup.dt.strftime("%a")
df1['2'] = df.pickup.dt.strftime("%A")
df1['3']=df['pickup'].dt.strftime("%b")
df1['4']=df['pickup'].dt.strftime("%B")
df1['5']=df['pickup'].dt.strftime("%c")
df1['6']=df['pickup'].dt.strftime("%C")
df1['7']=df['pickup'].dt.strftime("%Y/%m/%d")
df1.head(2)

,pickup,dropoff,Pickup_Month,Pickup_Week,Pickup_Day,Pickup_WeekDay,1,2,3,4,5,6,7
0,2019-03-23 20:21:09,2019-03-23 20:27:24,3,12,23,5,Sat,Saturday,Mar,March,Sat Mar 23 20:21:09 2019,20,2019/03/23
1,2019-03-04 16:11:55,2019-03-04 16:19:00,3,10,4,0,Mon,Monday,Mar,March,Mon Mar 4 16:11:55 2019,20,2019/03/04

# Getting Month Name without Strftime()function

In [86]:
df1['8']=df['pickup'].dt.month_name()
df1['9']=df['pickup'].dt.day_name()
df1.head(2)

,pickup,dropoff,Pickup_Month,Pickup_Week,Pickup_Day,Pickup_WeekDay,1,2,3,4,5,6,7,8,9
0,2019-03-23 20:21:09,2019-03-23 20:27:24,3,12,23,5,Sat,Saturday,Mar,March,Sat Mar 23 20:21:09 2019,20,2019/03/23,March,Saturday
1,2019-03-04 16:11:55,2019-03-04 16:19:00,3,10,4,0,Mon,Monday,Mar,March,Mon Mar 4 16:11:55 2019,20,2019/03/04,March,Monday

###  Now we can pull Hour/Minutes/Day/Weekday/Year/Seconds or any thing you want in DateTime format

In [87]:
col = ['pickup','dropoff']
df1 = df.loc[:,col]
print(df1.head(1))
df1 = df.iloc[:,0:2]
print(df1.head(1))

               pickup             dropoff
0 2019-03-23 20:21:09 2019-03-23 20:27:24
               pickup             dropoff
0 2019-03-23 20:21:09 2019-03-23 20:27:24

###  Now we can pull Hour/Minutes/Day/Weekday/Year/Seconds or any thing you want in DateTime format

In [88]:
df1['hour'] = df1.pickup.dt.hour
df1.head(1)

               pickup             dropoff  hour
0 2019-03-23 20:21:09 2019-03-23 20:27:24    20

In [89]:
df1['Minute'] = df.pickup.dt.minute
df1.head(1)

               pickup             dropoff  hour  Minute
0 2019-03-23 20:21:09 2019-03-23 20:27:24    20      21

In [90]:
df1['seconds'] = df.pickup.dt.second
df1.head(1)

               pickup             dropoff  hour  Minute  seconds
0 2019-03-23 20:21:09 2019-03-23 20:27:24    20      21        9

In [91]:
# The day of the week with Monday=0, Sunday=6
df1['WeekDay'] = df['pickup'].dt.weekday
df1.head(2)

               pickup             dropoff  hour  Minute  seconds  WeekDay
0 2019-03-23 20:21:09 2019-03-23 20:27:24    20      21        9        5
1 2019-03-04 16:11:55 2019-03-04 16:19:00    16      11       55        0

In [92]:
# It will give you the DAY of your date
df1['Day_Num'] = df['pickup'].dt.day
df1.head(2)

,pickup,dropoff,hour,Minute,seconds,WeekDay,Day_Num
0,2019-03-23 20:21:09,2019-03-23 20:27:24,20,21,9,5,23
1,2019-03-04 16:11:55,2019-03-04 16:19:00,16,11,55,0,4

In [93]:
# Getting Day Name of your date value
df1['Day_Name'] = df.pickup.dt.day_name()
df1.head(2)

,pickup,dropoff,hour,Minute,seconds,WeekDay,Day_Num,Day_Name
0,2019-03-23 20:21:09,2019-03-23 20:27:24,20,21,9,5,23,Saturday
1,2019-03-04 16:11:55,2019-03-04 16:19:00,16,11,55,0,4,Monday

In [95]:
# Getting Month Name of your Date Value
df['month_name'] = df.pickup.dt.month_name()
df.head(2)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,Pickup_Month,Pickup_Day,Pickup_Week,Pickup_WeekDay,month_name
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan,3,23,12,5,March
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan,3,4,10,0,March

### Use of DateTime method to Filter any Date Column - Or to put any condition > <

In [96]:
# Just create a new TimeSeries Variable
my_date = pd.to_datetime('10/1/2019')
print (type(my_date))
print (my_date)

<class 'pandas._libs.tslibs.timestamps.Timestamp'>
2019-10-01 00:00:00

In [117]:
print('Original Dataset Shape : ', df.shape)
print('After putting condition Dataset Shape : \n ' )
df.loc[df['pickup'] > '2019-03-05'].shape

Original Dataset Shape :  (6433, 19)
After putting condition Dataset Shape :

(5653, 19)

###  Mathematical Operations

In [124]:
# Fetching the record with having maximum date
df.loc[df['pickup'] ==df['pickup'].max(), :]

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,Pickup_Month,Pickup_Day,Pickup_Week,Pickup_WeekDay,month_name
591,2019-03-31 23:43:45,2019-04-01 00:13:58,5,12.25,37.0,0.0,0.0,40.8,yellow,cash,LaGuardia Airport,Williamsburg (South Side),Queens,Brooklyn,3,31,13,6,March

In [125]:
# Fetching the record with having minimum date
df.loc[df['pickup'] ==df['pickup'].min(), :]

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,Pickup_Month,Pickup_Day,Pickup_Week,Pickup_WeekDay,month_name
6203,2019-02-28 23:29:03,2019-02-28 23:32:35,1,0.9,5.0,0.0,0.0,6.3,green,cash,Old Astoria,Long Island City/Queens Plaza,Queens,Queens,2,28,9,3,February

In [137]:
# Fetching the records with above the average fare
df.loc[df['fare'] >= df['fare'].mean(), :]
print('Orignal dataset shape : ', df.shape)
print('\n')
print('After condition dataset shape : ', df.loc[df['fare'] >= df['fare'].mean(), :].shape)

Orignal dataset shape :  (6433, 19)


After condition dataset shape :  (1932, 19)

###  Working with DATETIME Library

In [138]:
# When we have a date in Date Format only
my_date = dt.date(2019,12,23)
my_date

datetime.date(2019, 12, 23)

In [140]:
my_date.month

12

In [141]:
my_date.day

23

In [143]:
my_date.year

2019

In [144]:
# When we want a date in Date and Time Format
m_date = dt.datetime(2020, 2, 22, 23, 25, 40)
print(m_date)
print(m_date.hour)
print(m_date.minute)
print(m_date.second)

2020-02-22 23:25:40
23
25
40

### Pandas TimeStamp

Even not putting time value in below date values - it will give you output with Time Value as well, because of TimeStamp

In [146]:
a= pd.Timestamp('2019-12-23')
b=pd.Timestamp('2020/2/29')
c=pd.Timestamp('2020, 2 , 29')
d=pd.Timestamp('2019-12-23 04:23:45 PM')
e=pd.Timestamp('2019-12-23 17:23:45 ')

In [151]:
e

Timestamp('2019-12-23 17:23:45')

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
    'date': pd.date_range('2000-01-01', '2010-01-01', freq='1M')
})
df1.head(4)

### Real DataSet

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import pyodbc
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=wn000043359;'
                      'Database=OptumRx_OGS;'
                      'Trusted_Connection=yes;')

In [5]:
df = pd.read_sql_query('SELECT * FROM [ScoreCard].[CAT_production_report]', conn)
df.head(2)

C:\Users\skum108\Anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,Serial_number,Auditor_name,Audit_type,hours_worked,Notes,Work_from,audit_date,total_audits,report_year
0,1,Santosh,PSS_Internal,3.00,None,work_from_home,2021-02-03,18.0,2021
1,2,Santosh,Meeting,0.75,Huddle,work_from_home,2021-02-03,0.0,2021

In [6]:
import datetime as dt

# Getting Month Name with Strftime()function

In [ ]:
df1['1'] = df.pickup.dt.strftime("%a")
df1['2'] = df.pickup.dt.strftime("%A")
df1['3']=df['pickup'].dt.strftime("%b")
df1['4']=df['pickup'].dt.strftime("%B")
df1['5']=df['pickup'].dt.strftime("%c")
df1['6']=df['pickup'].dt.strftime("%C")
df1['7']=df['pickup'].dt.strftime("%Y/%m/%d")

In [12]:
df['audit_date']=pd.to_datetime(df['audit_date'])

In [17]:
df['Audit_Month']=df['audit_date'].dt.strftime('%b')
df['Audit_Day']=df['audit_date'].dt.strftime('%a')
df.head(2)

,Serial_number,Auditor_name,Audit_type,hours_worked,Notes,Work_from,audit_date,total_audits,report_year,Audit_Month,Audit_Day
0,1,Santosh,PSS_Internal,3.00,None,work_from_home,2021-02-03,18.0,2021,Feb,Wed
1,2,Santosh,Meeting,0.75,Huddle,work_from_home,2021-02-03,0.0,2021,Feb,Wed

In [26]:
col_list=['Auditor_name', 'Audit_type', 'hours_worked', 'total_audits' , 'Audit_Month', 'Audit_Day']
df1 = df.loc[: , col_list ]
df2=df1.groupby(['Audit_type','Audit_Month', 'Audit_Day']).mean().head(20)
df1.groupby(['Audit_type','Audit_Month', 'Audit_Day']).mean().head(20)

                                  hours_worked  total_audits
Audit_type Audit_Month Audit_Day
           Aug         Tue            1.920000    291.000000
           Sep         Mon            8.000000      0.000000
Assignment Apr         Fri            0.375000      0.000000
                       Mon            1.333333      0.000000
                       Thu            2.000000      0.000000
                       Tue            1.250000      0.000000
                       Wed            0.500000      0.000000
           Aug         Fri            1.291667      0.000000
                       Mon            1.777778      0.000000
                       Thu            0.666667      0.000000
                       Tue            0.333333      0.000000
                       Wed            1.916667      4.333333
           Dec         Mon            1.550000      0.000000
                       Tue            0.250000      0.000000
                       Wed            0.500000      0.000000
           Feb         Fri            0.500000      0.000000
                       Mon            1.125000      0.000000
                       Wed            2.250000      0.000000
           Jul         Fri            1.821429      0.000000
                       Mon            1.666667      0.000000

In [28]:
df2.stack()

Audit_type  Audit_Month  Audit_Day
            Aug          Tue        hours_worked      1.920000
                                    total_audits    291.000000
            Sep          Mon        hours_worked      8.000000
                                    total_audits      0.000000
Assignment  Apr          Fri        hours_worked      0.375000
                                    total_audits      0.000000
                         Mon        hours_worked      1.333333
                                    total_audits      0.000000
                         Thu        hours_worked      2.000000
                                    total_audits      0.000000
                         Tue        hours_worked      1.250000
                                    total_audits      0.000000
                         Wed        hours_worked      0.500000
                                    total_audits      0.000000
            Aug          Fri        hours_worked      1.291667
                                    total_audits      0.000000
                         Mon        hours_worked      1.777778
                                    total_audits      0.000000
                         Thu        hours_worked      0.666667
                                    total_audits      0.000000
                         Tue        hours_worked      0.333333
                                    total_audits      0.000000
                         Wed        hours_worked      1.916667
                                    total_audits      4.333333
            Dec          Mon        hours_worked      1.550000
                                    total_audits      0.000000
                         Tue        hours_worked      0.250000
                                    total_audits      0.000000
                         Wed        hours_worked      0.500000
                                    total_audits      0.000000
            Feb          Fri        hours_worked      0.500000
                                    total_audits      0.000000
                         Mon        hours_worked      1.125000
                                    total_audits      0.000000
                         Wed        hours_worked      2.250000
                                    total_audits      0.000000
            Jul          Fri        hours_worked      1.821429
                                    total_audits      0.000000
                         Mon        hours_worked      1.666667
                                    total_audits      0.000000
dtype: float64